---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDGNExportAvailable
source: html/689e4558-a8ac-8d78-81fd-01d4e73a6b28.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDGNExportAvailable Method

Checks whether the DGN Export functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsDGNExportAvailable()
```

## Returns
True if the DGN Export functionality is available in the installed Revit.

## Remarks
DGN Export requires presence of certain modules that are optional and may not be part of the installed Revit.